{
  "title": "The Greed Compass",
  "file": "the-greed-compass.html",
  "publishedDate": "2025-08-10",
  "genre": "Psychological Horror, Mystery",
  "content": "<div class=\"story-content-meta\"> <div class=\"d-flex justify-content-between align-items-center flex-wrap\"> <div> <span class=\"genre-badge genre-psychological-horror\">Psychological Horror, Mystery</span> <small class=\"text-muted ms-2\"><i class=\"bi bi-calendar3\"></i> August 10, 2025</small> </div> </div> </div> <h1>The Greed Compass</h1> <p>Lightning split the midnight sky. Garron clung to the wet rope of the mainmast, each breath a hiss against the gale. The RedHawk ship groaned and pitched as waves crashed over the quarterdeck, rattling barrels and ropes that lashed them down. Garron’s eyes burned with saltwater and unease. In his gloved hand, the golden dagger was slick with rain, its blade catching a flash of light.</p> <p>“Hold fast!” barked Malric from the starboard watch. His face, crimson and twisted with wrath, was set under a soaked canvas hood. The furious quartermaster seized a coil of rope and sprang up to the chaos.</p> <p>On the foredeck, Preen stood swaying like a reed, hair plastered to her cheeks, gripping the wooden rail with slim hands. Her green eyes glittered strangely as lanterns swung, casting lewd shadows across her damp face. Sarella, the first mate, struck sparks with flint to relight a dying lantern; pride stiffened her spine despite the storm’s cruelty.</p> <p>The ship rattled like a rattlesnake. A mast shuddered. Garron swallowed against fear.</p> <p>Somewhere below, someone screamed. Garron choked on a scream of his own, as fear jerked his foot from purchase on deck. He plummeted toward the yawning black waves. The wind blasted into his ear with a roaring, cursing din.</p> <p>He imagined a hand, maybe his mother’s, reaching out to save him—then the mainmast snapped. Splinters sprayed. Garron crashed into wood, gravity tumbling him down a hatch into darkness.</p> <p>Silence.</p> <p>He lay coughing in darkness. His back felt mangled. As his eyes blinked open, the ocean’s gray light seeped through broken planks above. A plank lay across his shoulder. Pain stabbed through Garron’s ribs. He coughed and tasted salt. He pushed the wood free and pulled himself up onto a shattered deck.</p> <p>Dawn was pale and the sea violently still. The storm was gone.</p> <p>Men groaned. Wet groaning men. Garron staggered to his feet and looked around. The foredeck was wrecked and the sails dangled limp. Malric sat shivering by a broken drum, breathing raggedly. To port, Elsin lay twisted in the harness, eyes hollow with madness. On the quarterdeck, Sarella barked orders to men who were pressing down the splintered hull. Glane and Preen tended to the injured crew.</p> <p>Garron’s gaze drifted to the bloody gold in his fist — the dagger. It was an old family heirloom, sharp and cruel. It felt heavy against his palm, as if guiding his purpose. Father had left it to him in a letter years ago, saying it would “light your way to fortune.” Garron didn’t know how much more fortune his mother needed, dying from fever in a one-room hut when he was a child.</p> <p>He took a swig from a cracked flask at his belt. The liquor burned a promise of courage, though fear still coiled in Garron’s gut. He limped forward and approached Malric.</p> <p>“Status?” Garron asked, voice cracking.</p> <p>Malric spat seawater. “Dead sailmast,” he said between teeth. “Rigging’s torn, but we’re afloat. Nobody’s lost — at least not yet.”</p> <p>Garron’s chest tightened. Did he trust that? Elsin’s jaw was split, but he lived. It was morning. Something hovered in Garron’s mind, like a secret about to be spoken.</p> <p>“Devil’s Gate lies ahead,” Sarella said from the stern, holding her lantern aloft. Pride glinted in her eyes as much as the lantern’s flame. “We sailed the wrong course for days. But now the stars have fallen in line.”</p> <p>That name cut through Garron with a chill. The cursed Devil’s Gate treasure: whispered in every storm-tossed harbor. Greed had brought them here, after all. For Garron, hope flickered as bright and risky as those lightning flashes.</p> <p>He turned to Sarella. “Is the map true?”</p> <p>Sarella’s eyes were storm-slick. “Between us lies more than an ocean. The stars themselves pointed the way.”</p> <p>The crew shifted uneasily. Elsin muttered about curses. Volto grumbled through a yawn. Glane picked at a ration of salted meat with gravy on his fingers and half-closed eyes. Preen wiped a dripping hand on her skirt and fixed Garron with a smile that never reached her eyes.</p> <p>Garron glanced at her. Preen’s eyebrow arched — hunger or delight, he could never tell. His own name had meant promise — gritty and real. And now, standing at the cusp of legend, Garron felt something more than chance at work.</p> <p>* * *</p> <p>Days bled into nights on the open Pacific. ...</p> <p>...He held the dagger against his chest. Rain began to fall. Lightning split the sky. The RedHawk turned back toward the island, and Garron closed his eyes, whispering, “Again.”</p>"
}
